#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  // _ВКМ_Начало
ВКМ_УправлениеВидимостьюНовыхРеквизитов();
// _ВКМ_Конец
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
// _ВКМ_Начало
ВКМ_УправлениеВидимостьюНовыхРеквизитов();
// _ВКМ_Конец
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// _ВКМ_Начало
&НаСервере
Процедура ВКМ_УправлениеВидимостьюНовыхРеквизитов()
    
    ЭтоАбонентскийДоговор = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    
    Элементы.ВКМ_ДатаНачала.Видимость = ЭтоАбонентскийДоговор;
    Элементы.ВКМ_ДатаОкончания.Видимость = ЭтоАбонентскийДоговор;
    Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентскийДоговор;
    Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ЭтоАбонентскийДоговор;
    
КонецПроцедуры
// _ВКМ_Конец
#КонецОбласти
